Tekla Open API Reference for Tekla Structures 2025
MaterialItem.Select Method
 Selects the material item from the database based on the material name and alias name in this instance.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Select()
Public Function Select As Boolean
Return Value
Type: Boolean
True on success. False if the material was not found.
See Also
Reference
MaterialItem Class
Select Overload
Tekla.Structures.Catalogs Namespace